app/views/lists/show.html.erb

SELECT  "items".* FROM "items" WHERE "items"."list_id" = ? ORDER BY "items"."id" DESC LIMIT ?  [["list_id", 4], ["LIMIT", 1]]
---
<h1><%= @list.name %></h1>
<ul><% @list.items.each do |item| %>