app/controllers/items_controller.rb

  def new
    # /lists/:list_id/items/new
    @list = current_user.lists.find_by_id(params[:list_id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."id" = ? LIMIT ?  [["user_id", 3], ["id", 7], ["LIMIT", 1]]

  def create
    @list = current_user.lists.find_by_id(params[:list_id])
    @item = @list.items.build(item_params)
    @item.user_id = current_user.id
    if @item.save
---
SELECT  "lists".* FROM "lists" WHERE "lists"."user_id" = ? AND "lists"."id" = ? LIMIT ?  [["user_id", 3], ["id", 11], ["LIMIT", 1]]
INSERT INTO "items" ("description", "user_id", "list_id", "created_at", "updated_at", "completed") VALUES (?, ?, ?, ?, ?, ?)  [["description", "first item"], ["user_id", 2], ["list_id", 9], ["created_at", "2019-04-10 14:18:18.895429"], ["updated_at", "2019-04-10 14:18:18.895429"], ["completed", 0]]

  def edit
    @list = List.find_by_id(params[:list_id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]

  def update
    @list = List.find_by_id(params[:list_id])
    @item.user_id = current_user.id
    @item.list_id = @list.id
    if @item.update(item_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["description", "poop"], ["updated_at", "2019-04-18 04:18:43.090912"], ["id", 12]]

  def destroy
    @item.destroy
    @list = List.find_by_id(params[:list_id])
---
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 35]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]

  def set_item
    @item = Item.find_by_id(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]