app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["name", "test"], ["created_at", "2019-04-09 15:44:07.766498"], ["updated_at", "2019-04-09 15:44:07.766498"], ["user_id", 2]]
---
  def create

    @list = current_user.lists.build(list_params)
    if @list.save

UPDATE "lists" SET "name" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["name", "Super Great List"], ["updated_at", "2019-04-17 21:53:25.707455"], ["id", 7]]
---
  def update
    if @list.update(list_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def set_list
    @list = List.find_by_id(params[:id])