app/controllers/sessions_controller.rb

  def create
    # if auth_hash = request.env['omniauth.auth']
    #   @user = User.find_or_create_by_omniauth(auth_hash)
    #     session[:user_id] = @user.id


    #   else
    #     @user = User.create(:email => oauth_email, :password => 'SecureRandom.hex')
    #     session[:user_id] = @user.id
    #   end

    #   redirect_to lists_path
      @user = User.find_by(:email => params[:email])
      if @user && @user.authenticate(params[:password])
          session[:user_id] = @user.id
          redirect_to lists_path and return

     raise params elsif @user = User.find_by(:email => auth['info']['email'])

          if @user.uid.nil?
            @user.update(:uid => auth['uid'])
          end
      else
        @user = User.find_or_create_by(uid: auth['uid']) do |u|
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "morty@rick"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ananfro@gmail.com"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT ?  [["LIMIT", 1]]